In [3]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (13.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.0/13.0 MB 18.1 MB/s eta 0:00:0000:0100:01
Collecting numpy>=1.22.4
  Downloading numpy-2.1.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 16.3/16.3 MB 12.8 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: python-dateutil>=2.8.2 in /root/.local/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Collecting tzdata>=2022.7
  Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 KB 13.4 MB/s eta 0:00:00
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, numpy, pandas
Successfully installed numpy-2.1.1 pandas-2.2.2 tzdata-2024.1
WARNING: Running pip as the 'root' user can result in broken permissions and conflicting behaviour with the system package manager. It is recommended to use a virtual environment instead: https://pip.pypa.io/warnings/venv
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [35]:
df = pd.DataFrame({'Name': ['RACHEL', 'MONICA', 'PHOEBE',
                                   'ROSS', 'CHANDLER', 'JOEY'],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

In [39]:
df['Name'] = df['Name'].str().trim()

TypeError: 'StringMethods' object is not callable

In [36]:
df

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [37]:
df.query("Name==['MONICA','PHOEBE', 'ROSS']")

Empty DataFrame
Columns: [Name, Age, Salary, JOB]
Index: []

In [33]:
df

     Name  Age  Salary          JOB
1  MONICA   35   93000         CHEF
2  PHOEBE   37   88000        MASUS
3    ROSS   33  120000  PALENTOLOGY

In [31]:
df.query('(Name==['MONICA', 'PHOEBE']) and (Salary==['93000', '88000'])', inplace=True)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (2073900371.py, line 1)